{
    "html": "<ul><li><strong>Публикации в блоге Martin Jansson:</strong> Глубокий анализ и обратная разработка протокола связи аккумуляторов Makita.<ul><li><strong>Конкретное применение:</strong> Использован анализ фундаментальной структуры протокола связи, особенно логика реализации алгоритма контрольной суммы (CRC) и определение контактов физического уровня.</li><li><a href=\"https://martinjansson.netlify.app/posts/makita-battery-post-1\" target=\"_blank\">Makita Battery Post 1</a></li><li><a href=\"https://martinjansson.netlify.app/posts/makita-battery-post-2\" target=\"_blank\">Makita Battery Post 2</a></li></ul></li><li><strong>GitHub - Belik1982/esp32-makita-bms-reader:</strong> Ранняя и влиятельная реализация на ESP32 для чтения данных BMS Makita, ключевой источник для этого проекта.<ul><li><strong>Конкретное применение:</strong> Использован поток реализации связи на стороне ESP32, включая управление временными интервалами для отправки последовательностей команд (например, чтение модели аккумулятора, данных о напряжении) и логику разбора некоторых кодов ошибок.</li><li><a href=\"https://github.com/Belik1982/esp32-makita-bms-reader\" target=\"_blank\">Репозиторий проекта</a></li></ul></li><li><strong>Codeberg - Makita LXT Protocol:</strong> Предоставлена бесценная информация о протоколе и определениях структур данных.<ul><li><strong>Конкретное применение:</strong> Принята подробная карта памяти для точного разбора различных значений в пакетах ответов (таких как формат даты изготовления, количество циклов, счетчики переразряда/перегрузки).</li><li><a href=\"https://codeberg.org/rosvall/makita-lxt-protocol\" target=\"_blank\">Репозиторий проекта</a></li></ul></li><li><strong>Done.land - Makita LXT Digital Interface:</strong> Подробная документация по цифровому интерфейсу и логике связи.<ul><li><strong>Конкретное применение:</strong> Использовано объяснение электрических характеристик интерфейса аккумулятора для обеспечения правильного аппаратного подключения и понимания сигналов квитирования связи.</li><li><a href=\"https://done.land/components/power/powersupplies/battery/toolbatteries/makita/makitaltxdigitalinterface/\" target=\"_blank\">Ссылка на статью</a></li></ul></li><li><strong>GitHub - Open Battery Information:</strong> Совместный проект по документированию различных протоколов аккумуляторов, включая Makita.<ul><li><strong>Конкретное применение:</strong> Использовался в качестве источника для перекрестной проверки кодов команд протокола, подтверждая определение специальных команд, таких как 0xB6 (сброс флага предохранителя).</li><li><a href=\"https://github.com/mnh-jansson/open-battery-information\" target=\"_blank\">Репозиторий проекта</a></li></ul></li></ul>"
}