{
    "html": "<ul><li><strong>Martin Jansson's Blog Posts:</strong> In-depth analysis and reverse engineering of the Makita battery communication protocol.<ul><li><strong>Specific adoption:</strong> Referenced its fundamental structure analysis of the communication protocol, especially the implementation logic of the checksum (CRC) algorithm, and the definition of physical layer connection pins.</li><li><a href=\"https://martinjansson.netlify.app/posts/makita-battery-post-1\" target=\"_blank\">Makita Battery Post 1</a></li><li><a href=\"https://martinjansson.netlify.app/posts/makita-battery-post-2\" target=\"_blank\">Makita Battery Post 2</a></li></ul></li><li><strong>GitHub - Belik1982/esp32-makita-bms-reader:</strong> An early and influential ESP32 implementation for reading Makita BMS data, a key reference for this project.<ul><li><strong>Specific adoption:</strong> Referenced its ESP32-side communication implementation flow, including the timing control for sending command sequences (like reading battery model, voltage data), and the parsing logic for some error codes.</li><li><a href=\"https://github.com/Belik1982/esp32-makita-bms-reader\" target=\"_blank\">Project Repository</a></li></ul></li><li><strong>Codeberg - Makita LXT Protocol:</strong> Provided invaluable protocol information and data structure definitions.<ul><li><strong>Specific adoption:</strong> Adopted its detailed memory map for accurately parsing various values in the response packets (such as manufacturing date format, cycle counts, over-discharge/over-load counters).</li><li><a href=\"https://codeberg.org/rosvall/makita-lxt-protocol\" target=\"_blank\">Project Repository</a></li></ul></li><li><strong>Done.land - Makita LXT Digital Interface:</strong> Detailed documentation on the digital interface and communication logic.<ul><li><strong>Specific adoption:</strong> Referenced its explanation of the battery interface's electrical characteristics to ensure correct hardware connection, and the understanding of communication handshake signals.</li><li><a href=\"https://done.land/components/power/powersupplies/battery/toolbatteries/makita/makitaltxdigitalinterface/\" target=\"_blank\">Article Link</a></li></ul></li><li><strong>GitHub - Open Battery Information:</strong> A collaborative project to document various battery protocols, including Makita's.<ul><li><strong>Specific adoption:</strong> Used as a cross-validation source for protocol command codes, confirming the definition of special commands like 0xB6 (clear fuse flag).</li><li><a href=\"https://github.com/mnh-jansson/open-battery-information\" target=\"_blank\">Project Repository</a></li></ul></li></ul>"
}